cf_billing/InformationRegisters/энргСпособыРасчетаПоНаправлениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСпособыРасчетаПоНаправлениям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределенияСоциальнойНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияСоциальнойНормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьЗаПолныйМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСоциальногоНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоЧасам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗнаменательЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСпособыРасчетаПоНаправлениям/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет способы расчета по направлениям.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СпособыРасчетаПоНаправлениям(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСпособыРасчетаПоНаправлениям());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Услуга, НаправлениеИспользованияТУ, Сезонность, ВидПлощади";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Заполняет способы расчета по направлениям коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ИмяТаблицыПериодов	-	Строка.
//  ТаблицаДляПомещения	-	Строка.
// 
// Возвращаемое значение:
//   - 
//
Функция СпособыРасчетаПоНаправлениямКоллекцияПериодов(Схема,ПараметрыОтбора,ИмяТаблицыПериодов,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСпособыРасчетаПоНаправлениямКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	ОператорВыбора 							= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];
	ИсточникТаблицаПериодов 				= ОператорВыбора.Источники[0].Источник;
	Если НЕ ИсточникТаблицаПериодов.ИмяТаблицы = ИмяТаблицыПериодов Тогда
		ИсточникТаблицаПериодов.ИмяТаблицы 	= ИмяТаблицыПериодов;
	КонецЕсли;
	
	Источник 								= ОператорВыбора.Источники[1].Источник;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, Услуга, НаправлениеИспользованияТУ";
		ИмяТаблицы 							= "СпособыРасчетаПоНаправлениям";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
		 	
	ВспомогательныеПоля 					= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 				= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 						= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Получает значения параметров по направлениям услуг.
//
// Параметры:
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Период		-	Дата.
//  Услуга		-	СправочникСсылка.энргВидыУслуг.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ЗначенияПараметровПоНаправлениямУслуг(Организация,Район,Период,Услуга = Неопределено) Экспорт
	Схема							= Неопределено;
	ПараметрПериод					= Новый Структура("Период, ИмяПараметра","","Период");
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей" , "ТипПараметраРавно", Новый Структура("Организация,Район","Организация","Район")));
	СпособыРасчетаПоНаправлениям(Схема,Новый Структура("Период,ПараметрыВТ",ПараметрПериод,ПараметрыВТ));

	ВидыПлощадейПоНаправлениямУслуг = Новый Соответствие;
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 	Организация);
	ПараметрыЗапроса.Вставить("Район", 			Район);
	ПараметрыЗапроса.Вставить("Период", 		Период);
	ПараметрыЗапроса.Вставить("Услуга", 		Услуга);
	
	Результат  						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	Выборка  						= Результат.Выбрать();
	
	КлючиСтруктуры 					= "ВидПлощади,Сезонность,НормативПоДням,СпособОпределенияСоциальнойНормы";
	
	Пока Выборка.Следующий() Цикл
		ЗначенияПараметров 		= Новый Структура(КлючиСтруктуры);
		ЗаполнитьЗначенияСвойств(ЗначенияПараметров,Выборка);
			
		Если ВидыПлощадейПоНаправлениямУслуг[Выборка.Услуга] = Неопределено Тогда			
			СоотвествиеНаправление 	= Новый Соответствие;
			СоотвествиеНаправление.Вставить(Выборка.НаправлениеИспользованияТУ, ЗначенияПараметров);
			ВидыПлощадейПоНаправлениямУслуг.Вставить(Выборка.Услуга, СоотвествиеНаправление);
		Иначе
			ВидыПлощадейПоНаправлениямУслуг[Выборка.Услуга].Вставить(Выборка.НаправлениеИспользованияТУ, ЗначенияПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВидыПлощадейПоНаправлениямУслуг;
	
КонецФункции

// Получает значения параметров по направлениям услуг коллекция периодов.
//
// Параметры:
//  МВТ					-	МенеджерВременныхТаблиц.
//  Организация			-	СправочникСсылка.Организации.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  ИмяТаблицыПериодов	-	Строка.
//  Услуга				-	СправочникСсылка.энргВидыУслуг.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ЗначенияПараметровПоНаправлениямУслугКоллекцияПериодов(МВТ,Организация,Район,ИмяТаблицыПериодов,Услуга = Неопределено) Экспорт  
	Схема							= Неопределено;
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей" , "ТипПараметраРавно", Новый Структура("Организация,Район","Организация","Район")));
	Параметры  					= Новый Структура("ПараметрыВТ", ПараметрыВТ);
	СпособыРасчетаПоНаправлениямКоллекцияПериодов(Схема,Параметры,ИмяТаблицыПериодов);

	ВидыПлощадейПоНаправлениямУслуг = Новый Соответствие;
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 	Организация);
	ПараметрыЗапроса.Вставить("Район", 			Район);
		
	Результат  						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса,МВТ);
	Выборка  						= Результат.Выбрать();
	
	КлючиСтруктуры 					= "ВидПлощади,Сезонность,НормативПоДням,СпособОпределенияСоциальнойНормы";
	
	Пока Выборка.Следующий() Цикл
		ЗначенияПараметров 		= Новый Структура(КлючиСтруктуры);
		ЗаполнитьЗначенияСвойств(ЗначенияПараметров,Выборка);
		 		
		Если ВидыПлощадейПоНаправлениямУслуг[Выборка.ПериодНачисления] = Неопределено Тогда
						
			СоотвествиеНаправление 	= Новый Соответствие;
			СоотвествиеНаправление.Вставить(Выборка.НаправлениеИспользованияТУ, ЗначенияПараметров);
			
			СоотвествиеУслуга 		= Новый Соответствие;
			СоотвествиеУслуга.Вставить(Выборка.Услуга, СоотвествиеНаправление);
						
			ВидыПлощадейПоНаправлениямУслуг.Вставить(Выборка.ПериодНачисления, СоотвествиеУслуга);
		ИНачеЕсли ВидыПлощадейПоНаправлениямУслуг[Выборка.ПериодНачисления][Выборка.Услуга] = Неопределено Тогда			
			СоотвествиеНаправление 	= Новый Соответствие;
			СоотвествиеНаправление.Вставить(Выборка.НаправлениеИспользованияТУ, ЗначенияПараметров);
			ВидыПлощадейПоНаправлениямУслуг[Выборка.ПериодНачисления].Вставить(Выборка.Услуга, СоотвествиеНаправление);
		Иначе
			ВидыПлощадейПоНаправлениямУслуг[Выборка.ПериодНачисления][Выборка.Услуга].Вставить(Выборка.НаправлениеИспользованияТУ, ЗначенияПараметров);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВидыПлощадейПоНаправлениямУслуг;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса способы расчета по направлениям.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСпособыРасчетаПоНаправлениям() Экспорт 
	
	Текст =
	"ВЫБРАТЬ
	|	СпособыРасчетаПоНаправлениям.Организация КАК Организация,
	|	СпособыРасчетаПоНаправлениям.Район КАК Район,
	|	СпособыРасчетаПоНаправлениям.Услуга КАК Услуга,
	|	СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	СпособыРасчетаПоНаправлениям.ВидПлощади КАК ВидПлощади,
	|	СпособыРасчетаПоНаправлениям.Сезонность КАК Сезонность,
	|	СпособыРасчетаПоНаправлениям.НормативПоДням КАК НормативПоДням,
	|	СпособыРасчетаПоНаправлениям.НормативПоЧасам КАК НормативПоЧасам,
	|	СпособыРасчетаПоНаправлениям.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СпособыРасчетаПоНаправлениям.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,
	|	СпособыРасчетаПоНаправлениям.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива
	|ИЗ
	|	РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних КАК СпособыРасчетаПоНаправлениям";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса способы расчета по направлениям коллекция периодов .
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСпособыРасчетаПоНаправлениямКоллекцияПериодов() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	СпособыРасчетаПоНаправлениям.Организация КАК Организация,
	|	СпособыРасчетаПоНаправлениям.Район КАК Район,
	|	СпособыРасчетаПоНаправлениям.Услуга КАК Услуга,
	|	СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	СпособыРасчетаПоНаправлениям.ВидПлощади КАК ВидПлощади,
	|	СпособыРасчетаПоНаправлениям.Сезонность КАК Сезонность,
	|	СпособыРасчетаПоНаправлениям.НормативПоДням КАК НормативПоДням,
	|	СпособыРасчетаПоНаправлениям.НормативПоЧасам КАК НормативПоЧасам,
	|	СпособыРасчетаПоНаправлениям.СпособОпределенияСоциальнойНормы КАК СпособОпределенияСоциальнойНормы,
	|	СпособыРасчетаПоНаправлениям.НачислятьЗаПолныйМесяц КАК НачислятьЗаПолныйМесяц,
	|	СпособыРасчетаПоНаправлениям.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	|	СпособыРасчетаПоНаправлениям.СпособРасчетаСоциальногоНорматива КАК СпособРасчетаСоциальногоНорматива
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		СпособыРасчетаПоНаправлениям.Организация КАК Организация,
	|		СпособыРасчетаПоНаправлениям.Район КАК Район,
	|		СпособыРасчетаПоНаправлениям.Услуга КАК Услуга,
	|		СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		МАКСИМУМ(СпособыРасчетаПоНаправлениям.Период) КАК Период
	|	ИЗ
	|		ТаблицаПериодов КАК ТаблицаПериодов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|			ПО ТаблицаПериодов.ЗавершениеОП > СпособыРасчетаПоНаправлениям.Период
	|				И ТаблицаПериодов.Организация = СпособыРасчетаПоНаправлениям.Организация
	|				И ТаблицаПериодов.Район = СпособыРасчетаПоНаправлениям.Район
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		СпособыРасчетаПоНаправлениям.Организация,
	|		СпособыРасчетаПоНаправлениям.Район,
	|		СпособыРасчетаПоНаправлениям.Услуга,
	|		СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО ВложенныйЗапрос.Организация = СпособыРасчетаПоНаправлениям.Организация
	|			И ВложенныйЗапрос.Район = СпособыРасчетаПоНаправлениям.Район
	|			И ВложенныйЗапрос.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.Период = СпособыРасчетаПоНаправлениям.Период";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
